cdjq/DFRobot_RP2040_SCI/src/DFRobot_RP2040_SCI.cpp
/*!
 * @file DFRobot_RP2040_SCI.cpp
 * @brief This is an Arduino drive library for the DFRobot SCI Acquisition module. Users can read or set its config and data via I2C. The following demonstrates its detailed functions:
 * @n 1. Set or read the I2C address of the module as 0x21, 0x22 or 0x23, the factory default is 0x21, after the I2C address is changed, it will take effect after power-off and reboot;
 * @n 2. Set or read the config of Port1, Port2 or Port3:
 * @n    Port1: can be configured as analog or digital sensor mode, support NULL, Analog, and analog sensor SKU in analog sensor mode, and support digital sensor SKU in digital sensor mode
 * @n    Port2: can be configured as I2C or UART sensor mode, support NULL or I2C sensor in I2C sensor mode, in which I2C sensor will be automatically recognized by the module when powered on, and support UART sensor SKU in UART sensor mode
 * @n    Port3: can be configured as I2C or UART sensor mode, support NULL or I2C sensor in I2C sensor mode, in which I2C sensor will be automatically recognized by the module when powered on, and support UART sensor SKU in UART sensor mode
 * @n 3. Enable/disable data recording in CSV file
 * @n 4. Enable/disable OLED display
 * @n 5. Read the parameters of the sensors connected to the SCI Acquisition module：
 * @n      a. Get sensor data "name", separate names by a comma(,);
 * @n      b. Get sensor data "value", separate values by a comma(,);
 * @n      c. Get sensor data unit, separate units by a comma(,);
 * @n      d. Get the SKU of the connected sensor;
 * @n      e. Get the complete sensor information in the format of name:value unit, separate multiple pieces of information by a comma (,)
 * @n 6. Set and read the data refresh rate
 * @n 7. Get data refresh timestamp
 *
 * @copyright   Copyright (c) 2022 DFRobot Co.Ltd (http://www.dfrobot.com)
 * @license     The MIT License (MIT)
 * @author [Arya](xue.peng@dfrobot.com)
 * @maintainer [qsjhyy](yihuan.huang@dfrobot.com)
 * @version  V1.0
 * @date  2022-07-20
 * @url https://github.com/DFRobot/DFRobot_RP2040_SCI
 */
#include <Arduino.h>
#include "DFRobot_RP2040_SCI.h"

// #define RP2040_SUAB_DBG_ENABLE

#ifdef RP2040_SUAB_DBG_ENABLE
#define DEBUG_SERIAL  Serial
#define RP2040_SUAB_DBG(...) {DEBUG_SERIAL.print("["); DEBUG_SERIAL.print(__FUNCTION__); DEBUG_SERIAL.print("(): "); DEBUG_SERIAL.print(__LINE__); Serial.print(" ] "); DEBUG_SERIAL.println(__VA_ARGS__);}
#else
#define RP2040_SUAB_DBG(...)
#endif
#define IIC_MAX_TRANSFER     32     ///< Maximum transferred data via I2C
#define CMD_START            0x00
#define CMD_SET_IF0          0x00  ///< Set port 0 command, which can be used to configure the function and SKU on A&D ports
#define CMD_SET_IF1          0x01  ///< Set port 1 command, which can be used to configure the function and SKU on I2C1 & UART1 ports 
#define CMD_SET_IF2          0x02  ///< Set port 2 command, which can be used to configure the function and SKU on I2C2 & UART2 ports
#define CMD_READ_IF0         0x00  ///< Read the function and SKU on port 0
#define CMD_READ_IF1         0x01  ///< Read the function and SKU on port 1
#define CMD_READ_IF2         0x02  ///< Read the function and SKU on port 2

#define CMD_SET_ADDR         0x03  ///< Set I2C address (the command will take effect immediately when it's set successfully)
#define CMD_READ_ADDR        0x03  ///< Read I2C address (the command will take effect immediately when it's set successfully)
#define CMD_SET_TIME         0x04  ///< Set year, month, day, hour, minute, second 
#define CMD_GET_TIME         0x04  ///< Get year, month, day, hour, minute, second
#define CMD_RECORD_ON        0x05  ///< Switch on CSV recording
#define CMD_RECORD_OFF       0x06  ///< Switch off CSV recording

#define CMD_SCREEN_ON        0x07  ///< Switch on OLED display
#define CMD_SCREEN_OFF       0x08  ///< Switch on OLED display
#define CMD_GET_NAME         0x09  ///< Get sensor data name
#define CMD_GET_VALUE        0x0A  ///< Get sensor data value
#define CMD_GET_UNIT         0x0B  ///< Get sensor data unit
#define CMD_GET_SKU          0x0C  ///< Get sensor SKU, separate SKUs by a comma(,) 
#define CMD_GET_INFO         0x0D  ///< Get the sensor data name, value and unit name, separate value and unit name by space, and others by comma(,)

#define CMD_GET_KEY_VALUE0    0x0E  ///< Get the corresponding data value according to the data name
#define CMD_GET_KEY_VALUE1    0x0F  ///< Get the data value on the selected port according to the data name
#define CMD_GET_KEY_VALUE2    0x10  ///< Get the data value of the designated SKU on the selected port according to the data name
#define CMD_GET_KEY_UINT0     0x11  ///< Get the corresponding data unit according to the data name
#define CMD_GET_KEY_UINT1     0x12  ///< Get the data unit on the selected port according to the data name
#define CMD_GET_KEY_UINT2     0x13  ///< Get the data unit of the designated SKU on the selected port according to the data name
#define CMD_RESET             0x14  ///< Reset I2C peripheral(slave) transmitting cache
#define CMD_SKU_A             0x15  ///< Get the supported analog sensor SKU 
#define CMD_SKU_D             0x16  ///< Get the supported digital sensor SKU
#define CMD_SKU_IIC           0x17  ///< Get the supported I2C sensor SKU
#define CMD_SKU_UART          0x18  ///< Get the supported UART sensor SKU
#define CMD_GET_TIMESTAMP     0x19  ///< Get timestamp
#define CMD_SET_REFRESH_TIME  0x20  ///< Set refresh rate
#define CMD_GET_REFRESH_TIME  0x20  ///< Get refresh rate
#define CMD_GET_VERSION       0x21  ///< Get version number

#define CMD_END             CMD_GET_VERSION

#define STATUS_SUCCESS      0x53  ///< Status of successful response   
#define STATUS_FAILED       0x63  ///< Status of failed response 

#define DEBUG_TIMEOUT_MS    2000

#define ERR_CODE_NONE               0x00 ///< Normal communication 
#define ERR_CODE_CMD_INVAILED       0x01 ///< Invalid command
#define ERR_CODE_RES_PKT            0x02 ///< Response packet error
#define ERR_CODE_M_NO_SPACE         0x03 ///< Insufficient memory of I2C controller(master)
#define ERR_CODE_RES_TIMEOUT        0x04 ///< Response packet reception timeout
#define ERR_CODE_CMD_PKT            0x05 ///< Invalid command packet or unmatched command
#define ERR_CODE_SLAVE_BREAK        0x06 ///< Peripheral(slave) fault
#define ERR_CODE_ARGS               0x07 ///< Set wrong parameter
#define ERR_CODE_SKU                0x08 ///< The SKU is an invalid SKU, or unsupported by SCI Acquisition Module
#define ERR_CODE_S_NO_SPACE         0x09 ///< Insufficient memory of I2C peripheral(slave)
#define ERR_CODE_I2C_ADRESS         0x0A ///< Invalid I2C address
#if defined(ESP32)
#define I2C_ACHE_MAX_LEN            32//128
#else
#define I2C_ACHE_MAX_LEN            32
#endif

#define SKU_MAX_VAILD_LEN           7
typedef struct{
  uint8_t cmd;      /**< Command                     */
  uint8_t argsNumL; /**< Low byte of parameter number after the command    */
  uint8_t argsNumH; /**< High byte of parameter number after the command    */
  uint8_t args[0];  /**< The array with 0-data length, its size depends on the value of the previous variables argsNumL and argsNumH     */
}__attribute__ ((packed)) sCmdSendPkt_t, *pCmdSendPkt_t;

