cdjq/DFRobot_RP2040_SCI/src/DFRobot_RP2040_SCI.cpp
typedef struct{
  uint8_t status;   /**< Response packet status, 0x53, response succeeded, 0x63, response failed */
  uint8_t cmd;      /**< Response packet command */
  uint8_t lenL;     /**< Low byte of the buf array length excluding packet header */
  uint8_t lenH;     /**< High byte of the buf array length excluding packet header */
  uint8_t buf[0];   /**< The array with 0-data length, its size depends on the value of the previous variables lenL and lenH */
}__attribute__ ((packed)) sCmdRecvPkt_t, *pCmdRecvPkt_t;

DFRobot_SCI::DFRobot_SCI()
  :_timeout(DEBUG_TIMEOUT_MS){}

DFRobot_SCI::~DFRobot_SCI(){}

int DFRobot_SCI::begin(uint32_t freq){
  return init(freq);
}

uint16_t DFRobot_SCI::getVersion(){
  uint16_t version = 0;

  uint8_t errorCode;
  uint16_t length = 0;
  pCmdSendPkt_t sendpkt = NULL;
  sendpkt = (pCmdSendPkt_t)malloc(sizeof(sCmdSendPkt_t));
  if(sendpkt == NULL) return version;
  sendpkt->cmd = CMD_GET_VERSION;
  sendpkt->argsNumL = length & 0xFF;
  sendpkt->argsNumH = (length >> 8) & 0xFF;
  length += sizeof(sCmdSendPkt_t);
  sendPacket(sendpkt, length, true);
  free(sendpkt);
  
  pCmdRecvPkt_t rcvpkt = (pCmdRecvPkt_t)recvPacket(CMD_GET_VERSION, &errorCode);
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_FAILED)) errorCode = rcvpkt->buf[0];
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_SUCCESS)){
    length = (rcvpkt->lenH << 8) | rcvpkt->lenL;
    if(length == 2){
      version = (rcvpkt->buf[0] << 8) | rcvpkt->buf[1];
    }
  }
  if(rcvpkt) free(rcvpkt);
  return version;
}

String DFRobot_SCI::getVersionDescription(uint16_t version){
  String verstr = "V";
  verstr += String((version >> 8)&0xFF) + ".";
  verstr += String((version >> 4) & 0x0F) + ".";
  verstr += String(version & 0x0F);
  return verstr;
}


uint8_t DFRobot_SCI::setPort1(char *sku){
  uint8_t errorCode;
  pCmdSendPkt_t sendpkt = NULL;
  uint16_t length = 0;
  //1. Determine if the sku pointer is null
  if(sku == NULL){
    RP2040_SUAB_DBG("sku pointer is NULL");
    return ERR_CODE_ARGS;
  }
  //2. Determine sku length
  if(strlen(sku) > SKU_MAX_VAILD_LEN){
    RP2040_SUAB_DBG("sku length is too long!");
    return ERR_CODE_ARGS;
  }
  
  //3. Send command
  length            = (strlen(sku) > SKU_MAX_VAILD_LEN) ? SKU_MAX_VAILD_LEN : strlen(sku);
  sendpkt           = (pCmdSendPkt_t)malloc(sizeof(sCmdSendPkt_t) + length);
  if(sendpkt == NULL) return ERR_CODE_M_NO_SPACE;
  sendpkt->cmd      = CMD_SET_IF0;
  sendpkt->argsNumL = length & 0xFF;
  sendpkt->argsNumH = (length >> 8) & 0xFF;
  memcpy(sendpkt->args, sku, length);
  length += sizeof(sCmdSendPkt_t);
  sendPacket(sendpkt, length, true);
  free(sendpkt);

  pCmdRecvPkt_t rcvpkt = (pCmdRecvPkt_t)recvPacket(CMD_SET_IF0, &errorCode);
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_FAILED)) errorCode = rcvpkt->buf[0];
  if(rcvpkt) free(rcvpkt);
  return errorCode;
}

String DFRobot_SCI::getPort1(ePort1IFMode_t *mode){
  String config;

  uint8_t errorCode;
  uint16_t length = 0;
  pCmdSendPkt_t sendpkt = NULL;
  sendpkt = (pCmdSendPkt_t)malloc(sizeof(sCmdSendPkt_t));
  if(sendpkt == NULL) return "";
  sendpkt->cmd = CMD_READ_IF0;
  sendpkt->argsNumL = length & 0xFF;
  sendpkt->argsNumH = (length >> 8) & 0xFF;
  length += sizeof(sCmdSendPkt_t);
  sendPacket(sendpkt, length, true);
  free(sendpkt);
  
  pCmdRecvPkt_t rcvpkt = (pCmdRecvPkt_t)recvPacket(CMD_READ_IF0, &errorCode);
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_FAILED)) errorCode = rcvpkt->buf[0];
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_SUCCESS)){
    if(mode) *mode = (ePort1IFMode_t)rcvpkt->buf[0];
    length = (rcvpkt->lenH << 8) | rcvpkt->lenL;
    char sku[length];
    memcpy(sku, rcvpkt->buf + 1, length - 1);
    sku[length - 1] = '\0';
    config = String(sku);
  }
  if(rcvpkt) free(rcvpkt);
  return config;
}

uint8_t DFRobot_SCI::setPort2(char *sku){
  uint8_t errorCode;
  pCmdSendPkt_t sendpkt = NULL;
  uint16_t length = 0;
  //1. Determine if the sku pointer is null
  if(sku == NULL){
    RP2040_SUAB_DBG("sku pointer is NULL");
    return ERR_CODE_ARGS;
  }
  //2. Determine sku length
  if(strlen(sku) > SKU_MAX_VAILD_LEN){
    RP2040_SUAB_DBG("sku length is too long!");
    return ERR_CODE_ARGS;
  }
  
  //3. Send command
  length            = (strlen(sku) > SKU_MAX_VAILD_LEN) ? SKU_MAX_VAILD_LEN : strlen(sku);
  sendpkt           = (pCmdSendPkt_t)malloc(sizeof(sCmdSendPkt_t) + length);
  if(sendpkt == NULL) return ERR_CODE_M_NO_SPACE;
  sendpkt->cmd      = CMD_SET_IF1;
  sendpkt->argsNumL = length & 0xFF;
  sendpkt->argsNumH = (length >> 8) & 0xFF;
  memcpy(sendpkt->args, sku, length);
  length += sizeof(sCmdSendPkt_t);
  sendPacket(sendpkt, length, true);
  free(sendpkt);

  pCmdRecvPkt_t rcvpkt = (pCmdRecvPkt_t)recvPacket(CMD_SET_IF1, &errorCode);
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_FAILED)) errorCode = rcvpkt->buf[0];
  if(rcvpkt) free(rcvpkt);
  return errorCode;
}

String DFRobot_SCI::getPort2(ePort23Mode_t *mode){
  String config;

  uint8_t errorCode;
  uint16_t length = 0;
  pCmdSendPkt_t sendpkt = NULL;
  sendpkt = (pCmdSendPkt_t)malloc(sizeof(sCmdSendPkt_t));
  if(sendpkt == NULL) return "";
  sendpkt->cmd = CMD_READ_IF1;
  sendpkt->argsNumL = length & 0xFF;
  sendpkt->argsNumH = (length >> 8) & 0xFF;
  length += sizeof(sCmdSendPkt_t);
  sendPacket(sendpkt, length, true);
  free(sendpkt);
  
  pCmdRecvPkt_t rcvpkt = (pCmdRecvPkt_t)recvPacket(CMD_READ_IF1, &errorCode);
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_FAILED)) errorCode = rcvpkt->buf[0];
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_SUCCESS)){
    if(mode) *mode = (ePort23Mode_t)rcvpkt->buf[0];
    length = (rcvpkt->lenH << 8) | rcvpkt->lenL;
    char sku[length];
    memcpy(sku, rcvpkt->buf + 1, length - 1);
    sku[length - 1] = '\0';
    config = String(sku);
  }
  if(rcvpkt) free(rcvpkt);
  return config;
}

uint8_t DFRobot_SCI::setPort3(char *sku){
  uint8_t errorCode;
  pCmdSendPkt_t sendpkt = NULL;
  uint16_t length = 0;
  //1. Determine if the sku pointer is null
  if(sku == NULL){
    RP2040_SUAB_DBG("sku pointer is NULL");
    return ERR_CODE_ARGS;
  }
  //2. Determine sku length
  if(strlen(sku) > SKU_MAX_VAILD_LEN){
    RP2040_SUAB_DBG("sku length is too long!");
    return ERR_CODE_ARGS;
  }
  
  //3. Send command
  length            = (strlen(sku) > SKU_MAX_VAILD_LEN) ? SKU_MAX_VAILD_LEN : strlen(sku);
  sendpkt           = (pCmdSendPkt_t)malloc(sizeof(sCmdSendPkt_t) + length);
  if(sendpkt == NULL) return ERR_CODE_M_NO_SPACE;
  sendpkt->cmd      = CMD_SET_IF2;
  sendpkt->argsNumL = length & 0xFF;
  sendpkt->argsNumH = (length >> 8) & 0xFF;
  memcpy(sendpkt->args, sku, length);
  length += sizeof(sCmdSendPkt_t);
  sendPacket(sendpkt, length, true);
  free(sendpkt);

