cdjq/DFRobot_RP2040_SCI/src/DFRobot_RP2040_SCI.cpp
  pCmdRecvPkt_t rcvpkt = (pCmdRecvPkt_t)recvPacket(CMD_SET_IF2, &errorCode);
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_FAILED)) errorCode = rcvpkt->buf[0];
  if(rcvpkt) free(rcvpkt);
  return errorCode;
}

String DFRobot_SCI::getPort3(ePort23Mode_t *mode){
  String config;

  uint8_t errorCode;
  uint16_t length = 0;
  pCmdSendPkt_t sendpkt = NULL;
  sendpkt = (pCmdSendPkt_t)malloc(sizeof(sCmdSendPkt_t));
  if(sendpkt == NULL) return "";
  sendpkt->cmd = CMD_READ_IF2;
  sendpkt->argsNumL = length & 0xFF;
  sendpkt->argsNumH = (length >> 8) & 0xFF;
  length += sizeof(sCmdSendPkt_t);
  sendPacket(sendpkt, length, true);
  free(sendpkt);
  
  pCmdRecvPkt_t rcvpkt = (pCmdRecvPkt_t)recvPacket(CMD_READ_IF2, &errorCode);
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_FAILED)) errorCode = rcvpkt->buf[0];
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_SUCCESS)){
    if(mode) *mode = (ePort23Mode_t)rcvpkt->buf[0];
    length = (rcvpkt->lenH << 8) | rcvpkt->lenL;
    char sku[length];
    memcpy(sku, rcvpkt->buf + 1, length - 1);
    sku[length - 1] = '\0';
    config = String(sku);
  }
  if(rcvpkt) free(rcvpkt);
  return config;
}

void DFRobot_SCI::setRecvTimeout(uint32_t timeout){
  _timeout = timeout;
}

uint8_t DFRobot_SCI::adjustRtc(const __FlashStringHelper* date, const __FlashStringHelper* time){
  char buff[11];
  memcpy_P(buff, date, 11);
  uint16_t year = conv2d(buff + 9);
  uint8_t month = 0;
  // Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec
  switch (buff[0]) {
      case 'J': month = buff[1] == 'a' ? 1 : buff[2] == 'n' ? 6 : 7; break;   // hyy - Delete the second "month = "
      case 'F': month = 2; break;
      case 'A': month = buff[2] == 'r' ? 4 : 8; break;
      case 'M': month = buff[2] == 'r' ? 3 : 5; break;
      case 'S': month = 9; break;
      case 'O': month = 10; break;
      case 'N': month = 11; break;
      case 'D': month = 12; break;
  }
  uint8_t day = conv2d(buff + 4);
  memcpy_P(buff, time, 8);
  uint8_t hour = conv2d(buff);
  uint8_t minute = conv2d(buff + 3);
  uint8_t second = conv2d(buff + 6);

	uint8_t week = dayOfTheWeek(year, month, day);
	return adjustRtc(year,month,day,week,hour,minute,second);
}

uint8_t DFRobot_SCI::adjustRtc(uint16_t year, uint8_t month, uint8_t day, uint8_t week, uint8_t hour, uint8_t minute, uint8_t second){
  uint8_t errorCode;
  pCmdSendPkt_t sendpkt = NULL;
  uint16_t length = sizeof(year) + sizeof(month) + sizeof(day) + sizeof(week) + sizeof(hour) + sizeof(minute) + sizeof(second);
  sendpkt           = (pCmdSendPkt_t)malloc(sizeof(sCmdSendPkt_t) + length);
  if(sendpkt == NULL) return ERR_CODE_M_NO_SPACE;
  sendpkt->cmd      = CMD_SET_TIME;
  sendpkt->argsNumL = length & 0xFF;
  sendpkt->argsNumH = (length >> 8) & 0xFF; 
  sendpkt->args[0]  = second;
  sendpkt->args[1]  = minute;
  sendpkt->args[2]  = hour;
  sendpkt->args[3]  = day;
  sendpkt->args[4]  = week;
  sendpkt->args[5]  = month;
  sendpkt->args[6]  = year & 0xFF;
  sendpkt->args[7]  = (year >> 8) & 0xFF;
  length += sizeof(sCmdSendPkt_t);
  sendPacket(sendpkt, length, true);
  free(sendpkt);

  pCmdRecvPkt_t rcvpkt = (pCmdRecvPkt_t)recvPacket(CMD_SET_TIME, &errorCode);
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_FAILED)) errorCode = rcvpkt->buf[0];
  if(rcvpkt) free(rcvpkt);
  return errorCode;
}

uint8_t DFRobot_SCI::getRtcTime(uint16_t *year, uint8_t *month, uint8_t *day, uint8_t *week, uint8_t *hour, uint8_t *minute, uint8_t *second){
  uint8_t errorCode;
  pCmdSendPkt_t sendpkt = NULL;
  uint16_t length = 0;
  sendpkt           = (pCmdSendPkt_t)malloc(sizeof(sCmdSendPkt_t) + length);
  if(sendpkt == NULL) return ERR_CODE_M_NO_SPACE;
  sendpkt->cmd      = CMD_GET_TIME;
  sendpkt->argsNumL = 0;
  sendpkt->argsNumH = 0; 
  length += sizeof(sCmdSendPkt_t);
  sendPacket(sendpkt, length, true);
  free(sendpkt);

  pCmdRecvPkt_t rcvpkt = (pCmdRecvPkt_t)recvPacket(CMD_GET_TIME, &errorCode);
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_FAILED)) errorCode = rcvpkt->buf[0];
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_SUCCESS)){
    length = (rcvpkt->lenH << 8) | rcvpkt->lenL;
    if(length == 8){
      if(second) *second = rcvpkt->buf[0];
      if(minute) *minute = rcvpkt->buf[1];
      if(hour)   *hour   = rcvpkt->buf[2];
      if(day)    *day    = rcvpkt->buf[3];
      if(week)   *week   = rcvpkt->buf[4];
      if(month)  *month  = rcvpkt->buf[5];
      if(year)   *year   = rcvpkt->buf[6] | (rcvpkt->buf[7] << 8);
    }
  }
  if(rcvpkt) free(rcvpkt);
  return errorCode;
}

String DFRobot_SCI::getRtcTime(){
  uint8_t errorCode;
  String time = "";
  pCmdSendPkt_t sendpkt = NULL;
  uint16_t length = 0;
  sendpkt           = (pCmdSendPkt_t)malloc(sizeof(sCmdSendPkt_t) + length);
  if(sendpkt == NULL) return time;
  sendpkt->cmd      = CMD_GET_TIME;
  sendpkt->argsNumL = 0;
  sendpkt->argsNumH = 0; 
  length += sizeof(sCmdSendPkt_t);
  sendPacket(sendpkt, length, true);
  free(sendpkt);

  pCmdRecvPkt_t rcvpkt = (pCmdRecvPkt_t)recvPacket(CMD_GET_TIME, &errorCode);
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_FAILED)) errorCode = rcvpkt->buf[0];
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_SUCCESS)){
    length = (rcvpkt->lenH << 8) | rcvpkt->lenL;
    if(length == 8){
      String second = "", minute = "", hour = "", day = "", week = "", month = "", year = "";
      if(rcvpkt->buf[0] < 10) second = "0";
      second += String(rcvpkt->buf[0]);

      if(rcvpkt->buf[1] < 10) minute = "0";
      minute += String(rcvpkt->buf[1]);
      
      if(rcvpkt->buf[2] < 10) hour = "0";
      hour += String(rcvpkt->buf[2]);

      if(rcvpkt->buf[3] < 10) day = "0";
      day += String(rcvpkt->buf[3]);

      week = String(rcvpkt->buf[4]);

      if(rcvpkt->buf[5] < 10) month = "0";
      month += String(rcvpkt->buf[5]);

      year = String(rcvpkt->buf[6] | (rcvpkt->buf[7] << 8));

      time = year + '/' + month + '/' + day + ' ' + week + ' ' + hour + ':' + minute + ':' + second;
    }
  }
  if(rcvpkt) free(rcvpkt);
  return time;
}

uint8_t DFRobot_SCI::setRefreshRate(eRefreshRate_t refreshRate){
  uint8_t errorCode;
  uint16_t length = 1;
  
  pCmdSendPkt_t sendpkt = NULL;
  sendpkt = (pCmdSendPkt_t)malloc(sizeof(sCmdSendPkt_t) + 1);
  if(sendpkt == NULL) return ERR_CODE_S_NO_SPACE;
  sendpkt->cmd = CMD_SET_REFRESH_TIME;
  sendpkt->argsNumL = 1;
  sendpkt->argsNumH = 0;
  sendpkt->args[0]  = (uint8_t)refreshRate;
  length += sizeof(sCmdSendPkt_t);
  sendPacket(sendpkt, length, true);
  free(sendpkt);

