cdjq/DFRobot_RP2040_SCI/src/DFRobot_RP2040_SCI.cpp
  pCmdRecvPkt_t rcvpkt = (pCmdRecvPkt_t)recvPacket(CMD_SKU_UART, &errorCode);
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_FAILED)) errorCode = rcvpkt->buf[0];
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_SUCCESS)){
    length = (rcvpkt->lenH << 8) | rcvpkt->lenL;
    char buf[length + 1];
    memcpy(buf, rcvpkt->buf, length);
    buf[length] = '\0';
    sku = String(buf);
  }
  if(rcvpkt) free(rcvpkt);
  return sku;
}

void DFRobot_SCI::reset(uint8_t cmd){
  uint16_t length = 1;
  if(cmd > CMD_RESET) return;
  
  pCmdSendPkt_t sendpkt = NULL;
  sendpkt = (pCmdSendPkt_t)malloc(sizeof(sCmdSendPkt_t) + 1);
  if(sendpkt == NULL) return;
  sendpkt->cmd = CMD_RESET;
  sendpkt->argsNumL = 1;
  sendpkt->argsNumH = 0;
  sendpkt->args[0]  = cmd;

  length += sizeof(sCmdSendPkt_t);
  sendPacket(sendpkt, length, true);
  free(sendpkt);
  delay(1000);
}

uint32_t DFRobot_SCI::getRefreshRate_ms(uint8_t rate){
  switch(rate){
    case eRefreshRateMs:
         return 0;
    case eRefreshRate1s:
         return 1000;
    case eRefreshRate3s:
         return 3000;
    case eRefreshRate5s:
         return 5000;
    case eRefreshRate10s:
         return 10000;
    case eRefreshRate30s:
         return 30000;
    case eRefreshRate1min:
         return 60000;
    case eRefreshRate5min:
         return 300000;
    case eRefreshRate10min:
         return 600000;
    
  }
  return 0;
}

void * DFRobot_SCI::recvPacket(uint8_t cmd, uint8_t *errorCode){
  if(cmd > CMD_END){
    RP2040_SUAB_DBG("cmd is error!");
    if(errorCode) *errorCode = ERR_CODE_CMD_INVAILED; //There is no this command
    return NULL;
  }
  
  sCmdRecvPkt_t recvPkt;
  pCmdRecvPkt_t recvPktPtr = NULL;
  uint16_t length = 0;
  uint32_t t = millis();
  while(millis() - t < _timeout/*time_ms*/){
    recvData(&recvPkt.status, 1);
    switch(recvPkt.status){
      case STATUS_SUCCESS:
      case STATUS_FAILED:
      {
        recvData(&recvPkt.cmd, 1);
        if(recvPkt.cmd != cmd){
          reset(cmd);
          if(errorCode) *errorCode = ERR_CODE_RES_PKT; //Response packet error
          RP2040_SUAB_DBG("Response pkt is error!");
          return NULL;
        }
        recvData(&recvPkt.lenL, 2);
        length = (recvPkt.lenH << 8) | recvPkt.lenL;
        recvPktPtr = (pCmdRecvPkt_t)malloc(sizeof(sCmdRecvPkt_t) + length);
        if(recvPktPtr == NULL){
          reset(cmd);
          if(errorCode) *errorCode = ERR_CODE_M_NO_SPACE; //Insufficient memory of I2C controller(master)
          return NULL;
        }
        memcpy(recvPktPtr, &recvPkt, sizeof(sCmdRecvPkt_t));
        if(length) recvData(recvPktPtr->buf, length);
        if(errorCode) *errorCode = ERR_CODE_NONE;
        RP2040_SUAB_DBG(millis() - t);
        return recvPktPtr;
      }
    }
    delay(50);
    yield();
  }
  reset(cmd);
  if(errorCode) *errorCode = ERR_CODE_RES_TIMEOUT; //Receive packet timeout
  RP2040_SUAB_DBG("Time out!");
  RP2040_SUAB_DBG(millis() - t);
  return NULL;
}

uint8_t DFRobot_SCI::conv2d(const char* p)
{
	uint8_t v = 0;
    if ('0' <= *p && *p <= '9')
        v = *p - '0';
    return 10 * v + *++p - '0';
}



uint16_t DFRobot_SCI::date2days(uint16_t year, uint8_t month, uint8_t day)
{
	if (year >= 2000)
        year -= 2000;
  uint16_t days = day;
    for (uint8_t i = 1; i < month; ++i){
        switch(i){
            case 2:
                  days += 28;
                  break;
            case 4:
            case 6:
            case 9:
            case 11:
                  days += 30;
                  break;
            case 1:
            case 3:
            case 5:
            case 7:
            case 8:
            case 10:
            case 12:
                  days += 31;
                  break;
        }
    }
    if (month > 2 && year % 4 == 0)
        ++days; //Leap year
    //Leap years are divided into common and century leap years
    //The rule to decide leap year: In the Gregorian calendar, a common leap year is a year that is exactly divisible by 4 but not divisible by 100; a century leap year is a year that is exactly divisible by 400.
    //Add a leap year every 4 years, skip one every 100 years except every 400
    //The year 2000 is a leap year, 2004 is a leap year, 2100 is not a leap year, and 2104 is a leap year
    return days + 365 * year + (year + 3) / 4 - 1;
}

uint8_t DFRobot_SCI::dayOfTheWeek(uint16_t year, uint8_t month, uint8_t day)
{
	uint16_t days = date2days(year, month, day);
    return (days + 6) % 7; // Jan 1, 2000 is a Saturday, i.e. returns 6
}

DFRobot_RP2040_SCI_IIC::DFRobot_RP2040_SCI_IIC(uint8_t addr, TwoWire *pWire)
  :DFRobot_SCI(),_pWire(pWire),_addr(addr){
  
}

DFRobot_RP2040_SCI_IIC::~DFRobot_RP2040_SCI_IIC(){}

int DFRobot_RP2040_SCI_IIC::init(uint32_t freq){
  if (_pWire == NULL) return -1;
  _pWire->begin();
  _pWire->setClock(freq);
  _pWire->beginTransmission(_addr);
  if(_pWire->endTransmission() != 0) return -2;

  reset(CMD_RESET);
  return 0;
}

uint8_t DFRobot_RP2040_SCI_IIC::setI2CAddress(uint8_t addr){

  uint8_t errorCode;
  uint16_t length = 1;
  pCmdSendPkt_t sendpkt = NULL;
  sendpkt = (pCmdSendPkt_t)malloc(sizeof(sCmdSendPkt_t) + length);
  if(sendpkt == NULL) return ERR_CODE_M_NO_SPACE;
  sendpkt->cmd = CMD_SET_ADDR;
  sendpkt->argsNumL = length & 0xFF;
  sendpkt->argsNumH = (length >> 8) & 0xFF;
  sendpkt->args[0]  = addr;
  length += sizeof(sCmdSendPkt_t);
  sendPacket(sendpkt, length, true);
  free(sendpkt);
  
  pCmdRecvPkt_t rcvpkt = (pCmdRecvPkt_t)recvPacket(CMD_SET_ADDR, &errorCode);
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_FAILED)) errorCode = rcvpkt->buf[0];
  if(rcvpkt) free(rcvpkt);
  if(errorCode == ERR_CODE_NONE) _addr = addr;
  return errorCode;
}
uint8_t DFRobot_RP2040_SCI_IIC::getI2CAddress(){
  uint8_t errorCode;
  uint8_t addr = 0;
  uint16_t length = 0;
  pCmdSendPkt_t sendpkt = NULL;
  sendpkt = (pCmdSendPkt_t)malloc(sizeof(sCmdSendPkt_t));
  if(sendpkt == NULL) return 0;
  sendpkt->cmd = CMD_READ_ADDR;
  sendpkt->argsNumL = length & 0xFF;
  sendpkt->argsNumH = (length >> 8) & 0xFF;
  length += sizeof(sCmdSendPkt_t);
  sendPacket(sendpkt, length, true);
  free(sendpkt);
  
  pCmdRecvPkt_t rcvpkt = (pCmdRecvPkt_t)recvPacket(CMD_READ_ADDR, &errorCode);
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_FAILED)) errorCode = rcvpkt->buf[0];
  if((rcvpkt != NULL) && (rcvpkt->status == STATUS_SUCCESS)) addr = rcvpkt->buf[0];
  if(rcvpkt) free(rcvpkt);
  return addr;
}

void DFRobot_RP2040_SCI_IIC::sendPacket(void *pkt, int length, bool stop){
  uint8_t *pBuf = (uint8_t *)pkt;
  int remain = length;
  if((pkt == NULL) || (length == 0)) return;
  _pWire->beginTransmission(_addr);
  while(remain){
    length = (remain > IIC_MAX_TRANSFER) ? IIC_MAX_TRANSFER : remain;
    _pWire->write(pBuf, length);
    remain -= length;
    pBuf += length;
#if defined(ESP32)
    if(remain) _pWire->endTransmission(true);
#else
    if(remain) _pWire->endTransmission(false);
#endif
  }
  _pWire->endTransmission(stop);
}

int DFRobot_RP2040_SCI_IIC::recvData(void *data, int len){
  uint8_t *pBuf = (uint8_t *)data;
  int remain = len;
  int total = 0;
  if(pBuf == NULL){
    RP2040_SUAB_DBG("pBuf ERROR!! : null pointer");
    return 0;
  }
  
  while(remain){
    len = remain > I2C_ACHE_MAX_LEN ? I2C_ACHE_MAX_LEN : remain;
    remain -= len;
#if defined(ESP32)
    if(remain) _pWire->requestFrom((int)_addr, len, true);
#else
    if(remain) _pWire->requestFrom((int)_addr, len, false);
#endif
    else {   // hyy - else _pWire->requestFrom(_addr, len, true);
#if defined(NRF5) || defined(NRF52833)
      _pWire->requestFrom((int)_addr, len, false);
#else
      _pWire->requestFrom((int)_addr, len, true);
#endif
    }
    for(int i = 0; i < len; i++){
      pBuf[i] = _pWire->read();
      RP2040_SUAB_DBG(pBuf[i],HEX);
      yield();
    }
    pBuf += len;
    total += len;
  }
  return total;
}

void DFRobot_RP2040_SCI_IIC::recvFlush(){
  while(_pWire->available()){
    _pWire->read();
    yield();
  }
}

void DFRobot_RP2040_SCI_IIC::sendFlush(){
  _pWire->flush();
}
